Flow_around_cylider/constant/include/turbulenceModels
WALE
{
    delta           cubeRootVol;

    cubeRootVolCoeffs
    {
        deltaCoeff      1;
    }
}

kEqn
{
    delta           cubeRootVol;
    kEqnCoeffs
    {
        Ck                  0.094;
        Ce                  1.048;
    }
}

dynamicKEqn
{
    delta           cubeRootVol;
    dynamicKEqnCoeffs
    {
        filter          simple;
    }
}

Smagorinsky
{
    delta           cubeRootVol;
    SmagorinskyCoeffs
    {
        Ck                  0.094;
        Ce                  1.048;
    }
}
