Flow_around_cylider/system/include/forceCoeffs
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/

forceCoeffs
{
    type            forceCoeffs;
    libs            ("libforces.so");
    writeControl    timeStep;
    writeInterval   1;

    patches         ("cylinder");
    rho             rhoInf;           // Indicates incompressible
    log             true;
    rhoInf          1.225;            // Redundant for incompressible
    liftDir         (0 1 0);
    dragDir         (1 0 0);
    CofR            (0 0 0);          // Axle midpoint on ground
    pitchAxis       (0 0 1);
    magUInf         1;
    lRef            0.0585;           // Wheelbase length
    Aref            0.001711125;          // Estimated
}


// ************************************************************************* //
