Flow_around_cylider/system/include/probes
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/

probes
{
    type            probes;
    libs            ("libsampling.so");
    writeControl    timeStep;
    writeInterval   1;

    fields
    (
        p U
    );

    probeLocations
    (
        (-0.43875 0 0.01)    // - 7.5D
        (-0.29250 0 0.01)    // - 5.0D
        (-0.14625 0 0.01)    // - 2.5D
        ( 0.14625 0 0.01)    // - 2.5D
        ( 0.29250 0 0.01)    //   5.0D
        ( 0.43875 0 0.01)    //   7.5D
        ( 0.58500 0 0.01)    //  10.0D
        ( 0.73125 0 0.01)    //  12.5D
        ( 0.87750 0 0.01)    //  15.0D
        ( 1.02375 0 0.01)    //  17.5D
        ( 1.17000 0 0.01)    //  20.0D
        ( 0.08775 0.08775 0.01)

    );

}

// ************************************************************************* //
